app/controllers/bookmark_controller.rb

SELECT * FROM "pages" WHERE ("pages"."uri" = 'http://hoge.example.com/') LIMIT 1
INSERT INTO "bookmarks" ("comment", "created_at", "updated_at", "page_id", "user_id") VALUES('これは楽しい', '2009-05-05 06:17:49', '2009-05-05 06:17:49', 1, 1)
INSERT INTO "pages" ("uri", "created_at", "title", "updated_at") VALUES('http://hoge.example.com/', '2009-05-05 06:17:49', 'テスト', '2009-05-05 06:17:49')
---
  def add
    @myuser = current_user
    @page = Page.find_by_uri(params[:uri]) || Page.new(:uri => params[:uri])
    @page.title = params[:title]
    @bookmark = Bookmark.new
    @bookmark.user = @myuser
    @bookmark.page = @page
    @bookmark.comment = params[:comment]
    if request.post? && (@bookmark.save! rescue false)