app/controllers/user_controller.rb

  def show
    @myuser = current_user
    @user = params[:id].nil? ? @myuser : User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1